# üç± The DataFrame: A Collection of Series
A DataFrame is essentially a vertical stack of Series objects that share the same Index.

* The Series (1D): A single column of data.

* The DataFrame (2D): A collection of these columns joined together to form a table.

In [5]:
import pandas as pd 
import numpy as np

In [17]:
data = {
    'Name':  ["K M Tala","Mahin", "Hasib","Toma"],
    'Age': [20, 19, 28, 21],
    'City': ['Barguna', 'patuakhali', 'Dhaka', 'Kulana'],
    'Salary': [100000, 70000, 62000, 55000]
}

df = pd.DataFrame(data)

In [19]:
df

       Name  Age        City  Salary
0  K M Tala   20     Barguna  100000
1     Mahin   19  patuakhali   70000
2     Hasib   28       Dhaka   62000
3      Toma   21      Kulana   55000

 ### you also can create  dataframe using list

In [107]:
data_list = [
    ['K M Talha', 20, 'Barguna', 100000],
    ['Mahin', 19, 'patuakhali', 70000],
    ['Hasib', 27, 'Dhaka', 62000],
    ['Toma', 21, 'Kulana', 55000]
]

#df2 =pd.DataFrame(data_list)
#df2
columns = ["Name","Age","City","Salary"]  # if we not use colums then it give me index like 0,1,2 on columns
df2 = pd.DataFrame(data_list,columns=columns)  
df2

        Name  Age        City  Salary
0  K M Talha   20     Barguna  100000
1      Mahin   19  patuakhali   70000
2      Hasib   27       Dhaka   62000
3       Toma   21      Kulana   55000

## Selection and Indexing of Columns

In [115]:
df2['Age']  # select singal column

0    20
1    19
2    27
3    21
Name: Age, dtype: int64

In [113]:
df2[["Name","City"]] # to select multipal columns

        Name        City
0  K M Talha     Barguna
1      Mahin  patuakhali
2      Hasib       Dhaka
3       Toma      Kulana

## Creating a new column

In [117]:
df2["Designation"] = ["Eng.","Doct.","Teacher","Eng"]
df2

        Name  Age        City  Salary Designation
0  K M Talha   20     Barguna  100000        Eng.
1      Mahin   19  patuakhali   70000       Doct.
2      Hasib   27       Dhaka   62000     Teacher
3       Toma   21      Kulana   55000         Eng

 ## Removing Columns

In [119]:
df2.drop("Name", axis=1) #select asis=0 if you want to remove from row and  or select asix=1 to remove from column.

   Age        City  Salary Designation
0   20     Barguna  100000        Eng.
1   19  patuakhali   70000       Doct.
2   27       Dhaka   62000     Teacher
3   21      Kulana   55000         Eng

In [121]:
 #Use inplace if you want to permanently delete something from memory. 
# if you want to drop multipal column for drop then use multiple column  list 

df2.drop("Designation",axis=1, inplace= True)

In [123]:
df2

        Name  Age        City  Salary
0  K M Talha   20     Barguna  100000
1      Mahin   19  patuakhali   70000
2      Hasib   27       Dhaka   62000
3       Toma   21      Kulana   55000

## Selecting Rows

In [132]:
df2.loc[[0,1]]

        Name  Age        City  Salary
0  K M Talha   20     Barguna  100000
1      Mahin   19  patuakhali   70000

In [134]:
df2.iloc[0]

Name      K M Talha
Age              20
City        Barguna
Salary       100000
Name: 0, dtype: object

## Selecting Subsets of Rows and Columns

In [137]:
df2.loc[[0,1]] [["Name","Age"]]

        Name  Age
0  K M Talha   20
1      Mahin   19

## Conditional Selection

In [144]:
df2[(df2['Age']>20)| (df2['City'] == "Kulana")]

    Name  Age    City  Salary
2  Hasib   27   Dhaka   62000
3   Toma   21  Kulana   55000